app/Controllers/Employee.php

    public function overview()
    {
        date_default_timezone_set('Asia/Manila');
        $year = date('Y');
        $employeeModel = new \App\Models\employeeModel();
        $employee = $employeeModel->WHERE('employeeID',session()->get('employeeUser'))->first();
        //concern
        $builder = $this->db->table('tblemployee_concern');
        $builder->select('COUNT(*)total');
        $builder->WHERE('employeeID',session()->get('employeeUser'));
        $concern = $builder->get()->getResult();
        //memo
        $builder = $this->db->table('tblmemo');
        $builder->select('File,Subject,Date');
        $builder->orderby('memoID','DESC')->limit(3);
        $memo = $builder->get()->getResult();
        //celebrants
        $month = date('m');
        $builder = $this->db->table('tblemployee');
        $builder->select('Surname,Firstname,MI,Suffix,Designation,BirthDate');
        $builder->WHERE('DATE_FORMAT(BirthDate,"%m")',$month)->WHERE('Status',1);
        $builder->orderby('BirthDate','ASC');
        $celebrants = $builder->get()->getResult();
        //leave credits
        //vacation
        $builder = $this->db->table('tblcredit');
        $builder->select('Vacation');
        $builder->WHERE('employeeID',session()->get('employeeUser'))->WHERE('Year',$year);
        $vacation = $builder->get()->getResult();
        //sick
        $builder = $this->db->table('tblcredit');
        $builder->select('Sick');
        $builder->WHERE('employeeID',session()->get('employeeUser'))->WHERE('Year',$year);
---
SELECT `File`, `Subject`, `Date`
FROM `tblmemo`
ORDER BY `memoID` DESC
 LIMIT 3
SELECT `Surname`, `Firstname`, `MI`, `Suffix`, `Designation`, `BirthDate`
FROM `tblemployee`
WHERE DATE_FORMAT(BirthDate,"%m") = '09'
AND `Status` = 1
ORDER BY `BirthDate` ASC
SELECT *
FROM `tblmemo`
WHERE `Status` = 1
 LIMIT 4, 4
SELECT `Vacation`
FROM `tblcredit`
WHERE `employeeID` = '1'
AND `Year` = '2024'
SELECT `Sick`
FROM `tblcredit`
WHERE `employeeID` = '1'
AND `Year` = '2024'

    public function applyLeave()
    {
        //list of managers
        $employeeModel = new \App\Models\employeeModel();
        $employee = $employeeModel->WHERE('SalaryGrade','Managerial')->findAll();
        //celebrants
        $month = date('m');
        $builder = $this->db->table('tblemployee');
        $builder->select('Surname,Firstname,MI,Suffix,Designation,BirthDate');
        $builder->WHERE('DATE_FORMAT(BirthDate,"%m")',$month)->WHERE('Status',1);
        $builder->orderby('BirthDate','ASC');
        $celebrants = $builder->get()->getResult();
---
SELECT `Surname`, `Firstname`, `MI`, `Suffix`, `Designation`, `BirthDate`
FROM `tblemployee`
WHERE DATE_FORMAT(BirthDate,"%m") = '09'
AND `Status` = 1
ORDER BY `BirthDate` ASC

    public function concerns()
    {
        //celebrants
        $month = date('m');
        $builder = $this->db->table('tblemployee');
        $builder->select('Surname,Firstname,MI,Suffix,Designation,BirthDate');
        $builder->WHERE('DATE_FORMAT(BirthDate,"%m")',$month)->WHERE('Status',1);
        $builder->orderby('BirthDate','ASC');
        $celebrants = $builder->get()->getResult();
        //concerns
        $builder = $this->db->table('tblemployee_concern  a');
        $builder->select('a.Date,b.Title,a.Details,a.Status');
        $builder->join('tblconcern b','b.concernID=a.concernID','LEFT');
        $builder->WHERE('a.employeeID',session()->get('employeeUser'));
        $list = $builder->get()->getResult();
---
SELECT `Surname`, `Firstname`, `MI`, `Suffix`, `Designation`, `BirthDate`
FROM `tblemployee`
WHERE DATE_FORMAT(BirthDate,"%m") = '09'
AND `Status` = 1
ORDER BY `BirthDate` ASC
SELECT `Surname`, `Firstname`, `MI`, `Suffix`, `Designation`, `BirthDate`
FROM `tblemployee`
WHERE DATE_FORMAT(BirthDate,"%m") = '10'
AND `Status` = 1
ORDER BY `BirthDate` ASC
SELECT *
FROM `tblconcern`

    public function evaluate()
    {
        //celebrants
        $month = date('m');
        $builder = $this->db->table('tblemployee');
        $builder->select('Surname,Firstname,MI,Suffix,Designation,BirthDate');
        $builder->WHERE('DATE_FORMAT(BirthDate,"%m")',$month)->WHERE('Status',1);
        $builder->orderby('BirthDate','ASC');
        $celebrants = $builder->get()->getResult();
---
SELECT `Surname`, `Firstname`, `MI`, `Suffix`, `Designation`, `BirthDate`
FROM `tblemployee`
WHERE DATE_FORMAT(BirthDate,"%m") = '09'
AND `Status` = 1
ORDER BY `BirthDate` ASC