app/Controllers/Employee.php

SELECT *
FROM `tbl_logo`
 LIMIT 1
---
    public function overview()
    {
        //logo
        $logoModel = new \App\Models\logoModel();
        $logo = $logoModel->first();

SELECT `Sick`
FROM `tblcredit`
WHERE `employeeID` = '1'
AND `Year` = '2024'
---
        //sick
        $builder = $this->db->table('tblcredit');
        $builder->select('Sick');
        $builder->WHERE('employeeID',session()->get('employeeUser'))->WHERE('Year',$year);