app/Controllers/Home.php

SELECT COUNT(*)total
FROM `tblemployee`
WHERE `EmployeeStatus` = 'Regular'
---
    public function Overview()
    {
        //chart
        $builder = $this->db->table('tblemployee');
        $builder->select('DateCreated,COUNT(employeeID)total');
        $builder->groupBy('DateCreated');
        $query = $builder->get()->getResult();
        //recent employees
        $builder = $this->db->table('tblemployee');
        $builder->select('Surname,Firstname, MI, Suffix,Designation');
        $builder->orderBy('employeeID','DESC')->limit(5);
        $employee = $builder->get()->getResult();
        //regular
        $builder = $this->db->table('tblemployee');
        $builder->select('COUNT(*)total');
        $builder->WHERE('EmployeeStatus','Regular');
        $regular = $builder->get()->getRow();
        //probationary
        $builder = $this->db->table('tblemployee');
        $builder->select('COUNT(*)total');
        $builder->WHERE('EmployeeStatus','Probationary');
        $newlyHired = $builder->get()->getRow();
        //total
        $builder = $this->db->table('tblemployee');
        $builder->select('COUNT(*)total');
        $total = $builder->get()->getRow();