app/Controllers/Home.php

SELECT *
FROM `tbl_logo`
 LIMIT 1
---
    public function index()
    {
        $logoModel = new \App\Models\logoModel();
        $logo = $logoModel->first();

SELECT *
FROM `tbl_logo`
 LIMIT 1
SELECT `DateCreated`, COUNT(employeeID)total
FROM `tblemployee`
GROUP BY `DateCreated`
SELECT `Surname`, `Firstname`, `MI`, `Suffix`, `Designation`
FROM `tblemployee`
ORDER BY `employeeID` DESC
 LIMIT 5
SELECT *
FROM `tblemployee`
SELECT COUNT(*)total
FROM `tblemployee`
WHERE `EmployeeStatus` = 'Probationary'
AND `Status` = 1
---
    public function Overview()
    {
        //logo
        $logoModel = new \App\Models\logoModel();
        $logo = $logoModel->first();
        //chart
        $builder = $this->db->table('tblemployee');
        $builder->select('DateCreated,COUNT(employeeID)total');
        $builder->groupBy('DateCreated');
        $query = $builder->get()->getResult();
        //recent employees
        $builder = $this->db->table('tblemployee');
        $builder->select('Surname,Firstname, MI, Suffix,Designation');
        $builder->orderBy('employeeID','DESC')->limit(5);
        $employee = $builder->get()->getResult();
        //regular
        $builder = $this->db->table('tblemployee');
        $builder->select('COUNT(*)total');
        $builder->WHERE('EmployeeStatus','Regular')->WHERE('Status',1);
        $regular = $builder->get()->getRow();
        //probationary
        $builder = $this->db->table('tblemployee');
        $builder->select('COUNT(*)total');
        $builder->WHERE('EmployeeStatus','Probationary')->WHERE('Status',1);
        $newlyHired = $builder->get()->getRow();
        //total
        $builder = $this->db->table('tblemployee');
        $builder->select('COUNT(*)total');
        $builder->WHERE('Status',1);
        $total = $builder->get()->getRow();

SELECT *
FROM `tblemployee`
---
    public function Employee()
    {
        //logo
        $logoModel = new \App\Models\logoModel();
        $logo = $logoModel->first();
         //celebrants
        $month = date('m');
        $builder = $this->db->table('tblemployee');
        $builder->select('Surname,Firstname,MI,Suffix,Designation,BirthDate');
        $builder->WHERE('DATE_FORMAT(BirthDate,"%m")',$month)->WHERE('Status',1);
        $builder->orderby('BirthDate','ASC');
        $celebrants = $builder->get()->getResult();

SELECT `Surname`, `Firstname`, `MI`, `Suffix`, `Designation`, `BirthDate`
FROM `tblemployee`
WHERE DATE_FORMAT(BirthDate,"%m") = '09'
AND `Status` = 1
ORDER BY `BirthDate` ASC
---
    public function newUser()
    {
        //logo
        $logoModel = new \App\Models\logoModel();
        $logo = $logoModel->first();
        //celebrants
        $month = date('m');
        $builder = $this->db->table('tblemployee');
        $builder->select('Surname,Firstname,MI,Suffix,Designation,BirthDate');
        $builder->WHERE('DATE_FORMAT(BirthDate,"%m")',$month)->WHERE('Status',1);
        $builder->orderby('BirthDate','ASC');
        $celebrants = $builder->get()->getResult();

SELECT `Surname`, `Firstname`, `MI`, `Suffix`, `Designation`, `BirthDate`
FROM `tblemployee`
WHERE DATE_FORMAT(BirthDate,"%m") = '10'
AND `Status` = 1
ORDER BY `BirthDate` ASC
SELECT *
FROM `tbl_logo`
 LIMIT 1
---
    public function Maintenance()
    {
         //celebrants
        $month = date('m');
        $builder = $this->db->table('tblemployee');
        $builder->select('Surname,Firstname,MI,Suffix,Designation,BirthDate');
        $builder->WHERE('DATE_FORMAT(BirthDate,"%m")',$month)->WHERE('Status',1);
        $builder->orderby('BirthDate','ASC');
        $celebrants = $builder->get()->getResult();
        //logo
        $logoModel = new \App\Models\logoModel();
        $logo = $logoModel->first();

SELECT *
FROM `tbl_logo`
 LIMIT 1
---
    public function Account()
    {
        //logo
        $logoModel = new \App\Models\logoModel();
        $logo = $logoModel->first();